Autodesk.Revit.DB.Analysis.EnergyDataSettings.GetEnergyDataSettings(Autodesk.Revit.DB.Document)
Gets the energy data settings element in the document.
doc:
The document where the settings element is found.
Returns:
The element which stores the energy data settings for the document.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2011

Autodesk.Revit.DB.Analysis.EnergyDataSettings.AnalyticalSurfaceResolution
Analytical Surface Resolution defines the smallest dimension of any surface to be included in the energy analytical model.
This setting is ignored if AnalysisType is RoomsOrSpaces.
Remarks:
The resolution should be less than the smallest dimension of any surface to be included in the energy analytical model.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property:
Since:
2027

Autodesk.Revit.DB.Analysis.EnergyDataSettings.AnalyticalSpaceResolution
Analytical Space Resolution defines the minimum gap between Revit elements that will be ignored in the identification of energy analytical model spaces.
This setting is ignored if AnalysisType is RoomsOrSpaces.
Remarks:
The maximum distance between Revit elements that may be ignored in the identification of energy analytical model spaces is 2 times the Analytical Space Resolution setting.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property:
Since:
2027

Autodesk.Revit.DB.Analysis.EnergyDataSettings.DividePerimeter
If this is true, zones with exterior boundaries on each floor of the building will be divided based on geometric criteria.
Remarks:
Only works if AnalysisType is ConceptualMassesAndBuildingElements, the division of the perimeter zones is based on the difference of orientation, maximum length and depth.
Any exterior surfaces that have an angle of 45 degrees or more between them will be divided into separate zones.
Zones greater than 50 ft. will be divided equally. The CoreOffset will determine the depth of the zones.
The purpose of these divisions is to ensure that auto-generated zoning is appropriate for thermal loads generated by the relative position of the building to the sun path.
Since:
2011

Autodesk.Revit.DB.Analysis.EnergyDataSettings.EnergyModel
if this is on there should be an energy model dependent on the current AnalysisType
if it is off the conceptual energy model should be turned off
true if energy model is on, false otherwise
Since:
2011

Autodesk.Revit.DB.Analysis.EnergyDataSettings.CoreOffset
The default offset used to determine the outer perimeter to be divided into zones.
Ignored if AnalysisType is not ConceptualMassesAndBuildingElements.
Remarks:
Specifying a value here determines the zone depth and creates a core zone.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The given value for coreOffset must be between 0 and 30000 feet.
Since:
2011

Autodesk.Revit.DB.Analysis.EnergyDataSettings.IsExportMullionsEnabled
Indicates if mullions are included in GreenBuildingXML export of the detailed model.
This property only applies if AnalysisType is RoomsOrSpaces.
Remarks:
Result is based on the ExportComplexity setting.
When this setting is on, mullions will be exported as shading surfaces. A "simplified" analytical
shading surface is produced from a mullion based on its centerline, thickness, and offset.
Since:
2011

Autodesk.Revit.DB.Analysis.EnergyDataSettings.IsExportSimplifiedCurtainSystemsEnabled
Indicates if curtain system geometry is being simplified for GreenBuildingXML export of the detailed model.
This property only applies if AnalysisType is RoomsOrSpaces.
Remarks:
Result is based on the ExportComplexity setting.
Curtain Walls and Curtain Systems are normally exported as multiple openings, panel by panel, while for
energy analysis this can be more simply represented as a single glass surface as large as the entire curtain wall/system.
Normally, a curtain wall with 50 panels would be exported as 50 openings.  Often, exporting a single opening with
the total curtain system area is more appropriate.  When this setting is on, one "large" window/opening will be
exported for a curtain wall/system.
Since:
2011

Autodesk.Revit.DB.Analysis.EnergyDataSettings.IsExportShadingSurfacesEnabled
Indicates if "shading surfaces" are included in GreenBuildingXML export of the detailed model.
This property only applies if AnalysisType is RoomsOrSpaces.
Remarks:
Result is based on the ExportComplexity setting.
The method described by gbs/gbxml.org to calculate the shading surfaces is to
take all surfaces from the MEP spaces, subtract them from the surfaces from all building elements,
and then the remaining surfaces are considered to be the shading surfaces.
Since:
2011

Autodesk.Revit.DB.Analysis.EnergyDataSettings.AnalyticalGridCellSize
The cell size for the uniform cubical grid used when computing the building envelope.
This property is ingnored unless AnalysisType is RoomsOrSpaces and BuildingEnvelopeDeterminationMethod is IdentifyExteriorElements.
Remarks:
This is the size of the "cubes" used to divide the building shell
bounding box into a uniform cubical 3D grid.
Since:
2015

Autodesk.Revit.DB.Analysis.EnergyDataSettings.BuildingEnvelopeDeterminationMethod
Indicates if an analysis should be performed to find the model elements that are part of the building envelope.
Remarks:
The analysis is only performed when AnalysisType is RoomsOrSpaces.
This method uses a combination of ray-casting and flood-fill algorithms in order to find the building elements that are
exposed to the outside of the building. Analytical surface originated from the building elements in the envelope
will be classified as exterior or shading surfaces.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The building envelope determination method does not fall within an appropriate range.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2015

Autodesk.Revit.DB.Analysis.EnergyDataSettings.UseOutsideAirPerPerson
True if user is specifying outside air per person, false otherwise.
Deprecated in Revit 2027 and may be removed in a later version of Revit.
Since:
2011

Autodesk.Revit.DB.Analysis.EnergyDataSettings.UseHeatingCredits
Used in Heating and Cooling Loads Analysis (ViewHVACLoadsReport).
If true, Revit will use heating credits in the final load sum calculations.
If false, Revit will ignore heating credits in the final load sum calculations.
Since:
2011

Autodesk.Revit.DB.Analysis.EnergyDataSettings.ServiceType
Used in Heating and Cooling Loads Analysis (ViewHVACLoadsReport).
The type of heating or cooling system.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The service type does not fall within an appropriate range.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2011

Autodesk.Revit.DB.Analysis.EnergyDataSettings.ExportCategory
Value is a category indicating which discipline model will be used for GreenBuildingXML export.
This property only applies if AnalysisType is RoomsOrSpaces.
Remarks:
OST_Rooms will use the architectural 3d rooms for export.
OST_MEPSpaces will use the MEP 3d Spaces for export.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The export category is neither OST_Rooms nor OST_MEPSpaces.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2011

Autodesk.Revit.DB.Analysis.EnergyDataSettings.ProjectReportType
Used in Heating and Cooling Loads Analysis (ViewHVACLoadsReport).
Report type: None, simple, standard, detailed, compact.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The project report type does not fall within an appropriate range.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2011

Autodesk.Revit.DB.Analysis.EnergyDataSettings.BuildingConstructionClass
Used in Heating and Cooling Loads Analysis (ViewHVACLoadsReport).
Construction class of building as defined by:
loose, medium, tight, or none.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The building construction class does not fall within an appropriate range.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2011

Autodesk.Revit.DB.Analysis.EnergyDataSettings.ExportComplexity
Value determines Export Complexity when AnalysisType is RoomsOrSpaces.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The export complexity does not fall within an appropriate range.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2011

Autodesk.Revit.DB.Analysis.EnergyDataSettings.OutsideAirChangesRatePerHour
The number of times the volume of air interchanges in the room in one hour.
Remarks:
This number is a format for expressing the requirement for airflow.
The "flow" requirement for a room might be expressed, e.g.,
one room of 100 CF, and 3 Air Changes per Hour (ACH), would compute to 100 CF x 3 ACH / 60 min = 5 CFM.
Since:
2011

Autodesk.Revit.DB.Analysis.EnergyDataSettings.OutsideAirPerArea
The rate of flow of outside air available per unit area.
Remarks:
Stored in cubic feet per hour per square foot.
Since:
2011

Autodesk.Revit.DB.Analysis.EnergyDataSettings.OutsideAirPerPerson
The rate of flow of outside air available per person.
Remarks:
Stored in cubic feet per hour.
Since:
2011

Autodesk.Revit.DB.Analysis.EnergyDataSettings.SkylightWidth
Used for the conceptual energy model (AnalysisType is ConceptualMassesAndBuildingElements).
The approximate width used for the skylights in
massing instances when the Energy Analytical model is being created.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The skylight width is less than eight inches.
Since:
2011

Autodesk.Revit.DB.Analysis.EnergyDataSettings.PercentageSkylights
Used for the conceptual energy model (AnalysisType is ConceptualMassesAndBuildingElements).
The approximate percentage of the building roof surfaces for
masses.
Remarks:
This value is used to automatically model the skylights in
massing instances when the Energy Analytical model is being created.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The percentage skylights value is between 0.00 and 0.95.
Since:
2011

Autodesk.Revit.DB.Analysis.EnergyDataSettings.SillHeight
Used for the conceptual energy model (AnalysisType is ConceptualMassesAndBuildingElements).
The height from the nearest lower level used for auto-glazing created
on walls.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The sill height is less than zero.
Since:
2011

Autodesk.Revit.DB.Analysis.EnergyDataSettings.PercentageGlazing
Used for the conceptual energy model (AnalysisType is ConceptualMassesAndBuildingElements).
The approximate percentage of the building exterior wall surfaces
which are covered by windows or other glazing.
Remarks:
This value is used to automatically model glazed openings for
masses when the Energy Analytical model is being created.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The percentage glazing value is not between 0.00 and 0.95.
Since:
2011

Autodesk.Revit.DB.Analysis.EnergyDataSettings.SliverSpaceTolerance
This property only applies if AnalysisType is RoomsOrSpaces.
This value is used to identify sliver spaces, i.e. spaces bounded by parallel surfaces belonging to different rooms.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The sliver space tolerance is less than zero.
Since:
2011

Autodesk.Revit.DB.Analysis.EnergyDataSettings
This element contains settings for Export gbXML and Systems Analysis
and project level settings for Energy Analysis.
for serialization
Since:
2011